espressif/esp-idf/tools/test_apps/system/panic/panic_base/sdkconfig.ci.memprot_esp32s31
# Restricting to ESP32S31
CONFIG_IDF_TARGET="esp32s31"

# Enabling memory protection
CONFIG_ESP_SYSTEM_MEMPROT=y

# Enable memprot test
CONFIG_TEST_MEMPROT=y
